___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# Groupby

The groupby method allows you to group rows of data together and call aggregate functions

In [2]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [20]:
df = pd.DataFrame(data)
print(df)
del df["Person"]

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [21]:
df

  Company  Sales
0    GOOG    200
1    GOOG    120
2    MSFT    340
3    MSFT    124
4      FB    243
5      FB    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [22]:
 df.groupby('Company')

You can save this object as a new variable:

In [23]:
by_comp = df.groupby(["Company"]).size().reset_index(name='count')
print(type(by_comp))
by_comp

<class 'pandas.core.frame.DataFrame'>

  Company  count
0      FB      2
1    GOOG      2
2    MSFT      2

And then call aggregate methods off the object:

In [24]:
by_comp = df.groupby(["Company"])
by_comp

In [25]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [26]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [27]:
by_comp.min()

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [28]:
by_comp.max()

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [29]:
by_comp.count()

         Sales
Company
FB           2
GOOG         2
MSFT         2

In [30]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [31]:
by_comp.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [32]:
by_comp.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

In [33]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',  'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'], 
  
            'Rank': [1, 2, 2, 3, 3, 4, 1, 1, 2, 4, 1, 2], 
  
            'Year': [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017], 
  
            'Points': [876, 789, 863, 673, 741, 812, 756, 788, 694, 701, 804, 690]} 
  
# create dataframe 
df = pd.DataFrame(ipl_data) 
  
# use groupby() to generate mean 
df.groupby(['Team']).mean()

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

# Great Job!